---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyDueToBackgroundCalculation
source: html/74807ced-a1e5-8c9d-8636-ae3435e930e1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyDueToBackgroundCalculation Property

Cannot copy dragged elements while background calculations are in progress.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyDueToBackgroundCalculation { get; }
```